##### Setting up the environment and installing the required libraries

#### Connecting my neon postgres sql database using connection url

In [41]:
import psycopg2
import urllib.parse as urlparse

# My Neon databse url for connection
db_url = "postgresql://neondb_owner:npg_AYSBaf8TUhF3@ep-sweet-dust-a8827t3a-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"

# parsing the url to extract components 
parsed_url = urlparse.urlparse(db_url)
conn = psycopg2.connect(
    dbname=parsed_url.path[1:], 
    user=parsed_url.username,
    password=parsed_url.password,
    host=parsed_url.hostname,
    port=parsed_url.port,
    sslmode="require"
)
cursor = conn.cursor()
print(" Connected to Neon PostgreSQL database")

 Connected to Neon PostgreSQL database

##### Creating Employees table

In [42]:
create_table_query = """
CREATE TABLE IF NOT EXISTS employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(100),
    position VARCHAR(100),
    start_date DATE,
    salary INTEGER
);
"""

cursor.execute(create_table_query)
conn.commit()
print("The  Table 'employees' has been created")

The  Table 'employees' has been created

##### Generating the fake employee data

In [43]:
from faker import Faker
import random
from datetime import date

fake = Faker()

positions = [
    'Software Engineer', 'DevOps Engineer', 'Data Analyst', 'Backend Developer',
    'Frontend Developer', 'Machine Learning Engineer', 'IT Support Specialist',
]

def generate_employee():
    name = fake.name()
    position = random.choice(positions)
    start_date = fake.date_between(start_date=date(2015, 1, 1), end_date=date(2024, 12, 31))
    salary = random.randint(60000, 200000)
    return (name, position, start_date, salary)


employees = [generate_employee() for _ in range(50)]

##### Inserting the data into employees table

In [44]:
# SQL query to insert one row
insert_query = """
INSERT INTO employees (name, position, start_date, salary)
VALUES (%s, %s, %s, %s);
"""

# Execute batch insert
cursor.executemany(insert_query, employees)
conn.commit()

print("50 employees inserted into the 'employees' table successfully.")

50 employees inserted into the 'employees' table successfully.

##### Loading data using pandas

In [45]:
import pandas as pd
df = pd.read_sql_query("SELECT * FROM employees;", conn)

# Show the first few rows
df.head()

C:\Users\User\AppData\Local\Temp\ipykernel_20028\101730018.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM employees;", conn)

   employee_id               name           position  start_date  salary
0            1    Patrick Vincent    DevOps Engineer  2016-05-14  125782
1            2  Elizabeth Serrano  Software Engineer  2023-11-24   71303
2            3         Mark Avery  Software Engineer  2022-03-17  138438
3            4     Rachel Aguilar  Backend Developer  2018-12-21  178188
4            5         Mark Jones  Software Engineer  2016-05-31   67045

##### Checking for the null values

In [ ]:
# checking for the null values 
df.isnull().sum()

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

##### Data Transformation

In [48]:
# Extracting  the values 
df['start_year'] = pd.to_datetime(df['start_date']).dt.year
df[['start_date', 'start_year']].head()

   start_date  start_year
0  2016-05-14        2016
1  2023-11-24        2023
2  2022-03-17        2022
3  2018-12-21        2018
4  2016-05-31        2016

##### Doing the feature Engineering by calculating the years_of_service for each employee by substracting the start year from the current year

In [49]:
df['years_of_service'] = 2025 - df['start_year']
df[['name', 'start_year', 'years_of_service']].head()

                name  start_year  years_of_service
0    Patrick Vincent        2016                 9
1  Elizabeth Serrano        2023                 2
2         Mark Avery        2022                 3
3     Rachel Aguilar        2018                 7
4         Mark Jones        2016                 9